## Plan Result (prod_landing - TerraformPlanApply)




<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.databricks_cluster.databricks_cluster.interactive
  * module.data_landing_zone[&#34;00&#34;].module.databricks_cluster.databricks_sql_endpoint.serverless_warehouse
  * module.data_landing_zone[&#34;00&#34;].module.databricks_cluster.databricks_sql_global_config.this
  * module.data_landing_zone[&#34;00&#34;].module.vnet_peer_f5.azurerm_virtual_network_peering.initiator_to_target
  * module.data_landing_zone[&#34;00&#34;].module.vnet_peer_f5.azurerm_virtual_network_peering.target_to_initiator
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.databricks_cluster.databricks_cluster.interactive will be created
  + resource "databricks_cluster" "interactive" {
      + autotermination_minutes      = 30
      + cluster_id                   = (known after apply)
      + cluster_name                 = "interactive"
      + default_tags                 = (known after apply)
      + driver_instance_pool_id      = (known after apply)
      + driver_node_type_id          = (known after apply)
      + enable_elastic_disk          = (known after apply)
      + enable_local_disk_encryption = (known after apply)
      + id                           = (known after apply)
      + node_type_id                 = "Standard_D4ds_v5"
      + num_workers                  = 2
      + spark_conf                   = {
          + "spark.conf.set('fs.azure.account.auth.type.ingest02curatedsbox.dfs.core.windows.net', 'OAuth')"                                                                                                = "true"
          + "spark.conf.set('fs.azure.account.auth.type.ingest02externalsbox.dfs.core.windows.net', 'OAuth')"                                                                                               = "true"
          + "spark.conf.set('fs.azure.account.auth.type.ingest02landingsbox.dfs.core.windows.net', 'OAuth')"                                                                                                = "true"
          + "spark.conf.set('fs.azure.account.auth.type.ingest02rawsbox.dfs.core.windows.net', 'OAuth')"                                                                                                    = "true"
          + "spark.conf.set('fs.azure.account.oauth.provider.type.ingest02curatedsbox.dfs.core.windows.net', 'org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider')"                              = "true"
          + "spark.conf.set('fs.azure.account.oauth.provider.type.ingest02externalsbox.dfs.core.windows.net', 'org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider')"                             = "true"
          + "spark.conf.set('fs.azure.account.oauth.provider.type.ingest02landingsbox.dfs.core.windows.net', 'org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider')"                              = "true"
          + "spark.conf.set('fs.azure.account.oauth.provider.type.ingest02rawsbox.dfs.core.windows.net', 'org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider')"                                  = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.endpoint.ingest02curatedsbox.dfs.core.windows.net', 'https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token')"  = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.endpoint.ingest02externalsbox.dfs.core.windows.net', 'https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token')" = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.endpoint.ingest02landingsbox.dfs.core.windows.net', 'https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token')"  = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.endpoint.ingest02rawsbox.dfs.core.windows.net', 'https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token')"      = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.id.ingest02curatedsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-id}}')"                                                       = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.id.ingest02externalsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-id}}')"                                                      = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.id.ingest02landingsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-id}}')"                                                       = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.id.ingest02rawsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-id}}')"                                                           = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.secret.ingest02curatedsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-secret}}')"                                               = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.secret.ingest02externalsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-secret}}')"                                              = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.secret.ingest02landingsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-secret}}')"                                               = "true"
          + "spark.conf.set('fs.azure.account.oauth2.client.secret.ingest02rawsbox.dfs.core.windows.net', '{{secrets/key-vault-secrets/client-secret}}')"                                                   = "true"
        }
      + spark_version                = "14.3.x-scala2.12"
      + state                        = (known after apply)
      + url                          = (known after apply)
    }

  # module.data_landing_zone["00"].module.databricks_cluster.databricks_sql_endpoint.serverless_warehouse will be created
  + resource "databricks_sql_endpoint" "serverless_warehouse" {
      + auto_stop_mins            = 120
      + cluster_size              = "Small"
      + creator_name              = (known after apply)
      + data_source_id            = (known after apply)
      + enable_photon             = true
      + enable_serverless_compute = true
      + health                    = (known after apply)
      + id                        = (known after apply)
      + jdbc_url                  = (known after apply)
      + max_num_clusters          = 1
      + name                      = "serverless_warehouse"
      + num_active_sessions       = (known after apply)
      + num_clusters              = (known after apply)
      + odbc_params               = (known after apply)
      + spot_instance_policy      = "COST_OPTIMIZED"
      + state                     = (known after apply)
      + warehouse_type            = "CLASSIC"

      + tags {
          + custom_tags {
              + key   = "ResourceClass"
              + value = "Serverless"
            }
        }
    }

  # module.data_landing_zone["00"].module.databricks_cluster.databricks_sql_global_config.this will be created
  + resource "databricks_sql_global_config" "this" {
      + data_access_config        = {
          + "spark.hadoop.fs.azure.account.auth.type.ingest02curatedsbox.dfs.core.windows.net"               = "OAuth"
          + "spark.hadoop.fs.azure.account.auth.type.ingest02externalsbox.dfs.core.windows.net"              = "OAuth"
          + "spark.hadoop.fs.azure.account.auth.type.ingest02landingsbox.dfs.core.windows.net"               = "OAuth"
          + "spark.hadoop.fs.azure.account.auth.type.ingest02rawsbox.dfs.core.windows.net"                   = "OAuth"
          + "spark.hadoop.fs.azure.account.oauth.provider.type.ingest02curatedsbox.dfs.core.windows.net"     = "org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider"
          + "spark.hadoop.fs.azure.account.oauth.provider.type.ingest02externalsbox.dfs.core.windows.net"    = "org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider"
          + "spark.hadoop.fs.azure.account.oauth.provider.type.ingest02landingsbox.dfs.core.windows.net"     = "org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider"
          + "spark.hadoop.fs.azure.account.oauth.provider.type.ingest02rawsbox.dfs.core.windows.net"         = "org.apache.hadoop.fs.azurebfs.oauth2.ClientCredsTokenProvider"
          + "spark.hadoop.fs.azure.account.oauth2.client.endpoint.ingest02curatedsbox.dfs.core.windows.net"  = "https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token"
          + "spark.hadoop.fs.azure.account.oauth2.client.endpoint.ingest02externalsbox.dfs.core.windows.net" = "https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token"
          + "spark.hadoop.fs.azure.account.oauth2.client.endpoint.ingest02landingsbox.dfs.core.windows.net"  = "https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token"
          + "spark.hadoop.fs.azure.account.oauth2.client.endpoint.ingest02rawsbox.dfs.core.windows.net"      = "https://login.microsoftonline.com/{{secrets/key-vault-secrets/tenant-id}}/oauth2/token"
          + "spark.hadoop.fs.azure.account.oauth2.client.id.ingest02curatedsbox.dfs.core.windows.net"        = "{{secrets/key-vault-secrets/client-id}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.id.ingest02externalsbox.dfs.core.windows.net"       = "{{secrets/key-vault-secrets/client-id}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.id.ingest02landingsbox.dfs.core.windows.net"        = "{{secrets/key-vault-secrets/client-id}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.id.ingest02rawsbox.dfs.core.windows.net"            = "{{secrets/key-vault-secrets/client-id}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.secret.ingest02curatedsbox.dfs.core.windows.net"    = "{{secrets/key-vault-secrets/client-secret}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.secret.ingest02externalsbox.dfs.core.windows.net"   = "{{secrets/key-vault-secrets/client-secret}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.secret.ingest02landingsbox.dfs.core.windows.net"    = "{{secrets/key-vault-secrets/client-secret}}"
          + "spark.hadoop.fs.azure.account.oauth2.client.secret.ingest02rawsbox.dfs.core.windows.net"        = "{{secrets/key-vault-secrets/client-secret}}"
        }
      + enable_serverless_compute = (known after apply)
      + id                        = (known after apply)
      + security_policy           = "DATA_ACCESS_CONTROL"
      + sql_config_params         = {
          + "ANSI_MODE" = "true"
        }
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.vnet_peer_f5.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "ingest00-vnet-prod-to-f5"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
      + resource_group_name                    = "ingest00-network-prod"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "ingest00-vnet-prod"
    }

  # module.data_landing_zone["00"].module.vnet_peer_f5.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "f5-to-ingest00-vnet-prod"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod"
      + resource_group_name                    = "mgmt-vpn-2-mgmt"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "mgmt-vpn-2-vnet"
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":91,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->